FinalProj/TestMeshes/MeshTest1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       6100;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       6150;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          125;
        startFace       6200;
    }
    wedge1
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          1250;
        startFace       6325;
    }
    wedge2
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          1250;
        startFace       7575;
    }
    wedge3
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          625;
        startFace       8825;
    }
    wedge4
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          625;
        startFace       9450;
    }
    wedge5
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          1250;
        startFace       10075;
    }
    wedge6
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          1250;
        startFace       11325;
    }
    empty
    {
        type            patch;
        nFaces          0;
        startFace       12575;
    }
)

// ************************************************************************* //
